{
	"Elderflower and Lemon Curd Celebration Cake": {
		"title": "Elderflower and Lemon Curd Celebration Cake",
		"description": "Having a celebration? Delight your guests with this fresh tasting Elderflower and Lemon Curd cake.",
		"prep_time": "PT20M",
		"prep_time_long": "20 minutes",
		"cook_time": "PT30M",
		"cook_time_long": "30 minutes",
		"yeild": "5 - 7",
		"yeild_long": "1 Cake",
		"image": "elderflower-and-lemon-curd-celebration-cake.jpg",
		"ingredients": {
			"Cake": {
				"0": "250g Flora Buttery",
				"1": "250g caster sugar",
				"2": "4 medium eggs",
				"3": "250g self-raising flour",
				"4": "2 lemons zest and juice",
				"5": "1/2 jar good-quality lemon curd"
			},
			"Flora Icing": {
				"0": "200g Flora Buttery",
				"1": "500g icing sugar",
				"2": "2 tbsps elderflower cordial",
				"3": "2 tbsps lemon juice"
			},
			"Drizzle": {
				"12": "2 tbsps elderflower cordial",
				"13": "2 tbsps lemon juice"
			},
			"Decoration": {
				"0": "Pesticide free flowers of choice for decoration"
			}
		},
		"directions": {
			"0": "Preheat oven to 180°C, 160°C fan, Gas mark 4. Grease and bottom line 2 2 x 20cm round cake tins with baking paper.",
			"1": "Beat the Flora Buttery and sugar together until light and fluffy. Beat in the eggs one at a time, then fold in the lemon zest and flour. Divide evenly between the two cake tins and level the surface.",
			"2": "Bake for 30 minutes or until a skewer comes out clean. Leave to cool for 5 minutes then turn out to cool on a cooling rack.",
			"3": "To make the icing beat the Flora Buttery and icing sugar together with 2 tablespoons of elderflower cordial and 2 tablespoons of lemon juice until light and creamy. To make the drizzle simply blend 2 tablespoons elderflower cordial with 2 tablespoons lemon juice (or more if you like a sharper lemon flavour).",
			"4": "To assemble, slice each of the sponges horizontally and place the first sponge on a serving plate. Sprinkle a little drizzle over the base, then spread lemon curd over and top with the 2nd sponge. Sprinkle drizzle over and spread a layer of icing. Top with the 3rd sponge, sprinkle with drizzle and spread with lemon curd. Top with the remaining sponge and spread icing all over the cake to coat.",
			"5": "Pipe a ring of pearls around the base of the cake, decorate with fresh flowers and serve."
		}
	},
	"Chocolate Brownies": {
		"title": "Chocolate Brownies",
		"description": "No-one can resist a rich, gooey chocolate brownie. This easy recipe includes cocoa powder, dark chocolate, vanilla, set natural yogurt and Flora Cuisine – all speckled with crunchy flaked almonds. Just mix them all up, pour into a pan and bake. Simple. With very little effort you’ll be cutting up warm chocolate brownies ready to hand out – but be warned, they’ll all be gone just as quickly and easily!",
		"prep_time": "PT20M",
		"prep_time_long": "20 minutes",
		"cook_time": "PT45M",
		"cook_time_long": "45 minutes",
		"yeild": "5 - 7",
		"yeild_long": "Serves 4 - 6",
		"image": "chocolate-brownies.jpg",
		"ingredients": {
			"0": "115 g (4oz) plain chocolate",
			"1": "4 tbsp Flora Cuisine",
			"2": "3 Medium eggs",
			"3": "225 g (8oz) caster sugar",
			"4": "1 tsp vanilla extract",
			"5": "40 g (1½oz) plain flour",
			"6": "25 g (1oz) cocoa powder",
			"7": "1 tsp baking powder",
			"8": "55 g (2oz) natural yogurt",
			"9": "85 g (3oz) flaked almonds"
		},
		"directions": {
			"0": "Break the chocolate into a bowl and melt over a pan of hot water (or in a microwave on medium power). Add the Flora Cuisine.",
			"1": "In a large bowl, whisk the eggs with the sugar and vanilla until creamy and slightly thickened.",
			"2": "Sieve the dry ingredients and add to the eggs with the chocolate mixture, yogurt and nuts. Mix gently.",
			"3": "Pour into a greased 22cm (9 inch) square tin.",
			"4": "Bake in a preheated oven at 160°C, 150°C fan, gas mark 3 for 45–55 minutes.",
			"5": "Leave to cool before cutting into squares."
		}
	},
	"American Pancakes": {
		"title": "American Pancakes",
		"description": "These American pancakes are thick, fluffy and ready to stack high on a plate, just like in the movies! The difference from regular pancakes is that these bubble and rise a little in the pan – but they are still wonderfully simple to make. Serve them with Flora Buttery, syrup and fruit (or even crisp bacon for a special treat) for a deliciously easy breakfast recipe.",
		"prep_time": "PT5M",
		"prep_time_long": "5 minutes",
		"cook_time": "PT4M",
		"cook_time_long": "4 minutes",
		"yeild": "4 - 6",
		"yeild_long": "Serves 4 - 6",
		"image": "american-pancakes.jpg",
		"ingredients": {
			"0": "125 g (4.5 oz) self-raising flour",
			"1": "2 tsp baking powder",
			"2": "1/4 tsp salt",
			"3": "1 Medium egg",
			"4": "250 ml (8fl oz) milk",
			"5": "2 tbsp Flora Cuisine"
		},
		"directions": {
			"0": "In a medium mixing bowl sift all of the dry ingredients together. Make a well in the middle and set aside.",
			"1": "In a separate bowl or jug, combine the wet ingredients and whisk together until well combined.",
			"2": "Add the wet mix to the dry mix and stir until just moistened. The mixture will be lumpy but that’s fine.",
			"3": "Heat a frying pan and add a little Flora Cuisine. Once it's hot, drop ladles of the mix onto the pan. Once they are bubbly on the top and the edges appear dry (after about 2 minutes), it’s time to turn them.",
			"4": "Cook for a further 2 mins. Serve immediately with a dollop of Flora Buttery and maple or golden syrup."
		}
	},
	"Pumpkin & Orange Spider Muffins": {
		"title": "Pumpkin & Orange Spider Muffins",
		"description": "Made with a healthy helping of pumpkin, these muffins taste a bit like carrot cake. Decorating them is a great chance to practise your icing skills, and because you’re making cobwebs, you needn’t worry about getting the lines perfectly straight. You even get to make a scary spider from liquorice sweets and laces!",
		"prep_time": "PT15M",
		"prep_time_long": "15 minutes",
		"cook_time": "PT25M",
		"cook_time_long": "25 minutes",
		"yeild": "4 - 6",
		"yeild_long": "Serves 4 - 6",
		"image": "pumpkin-and-orange-spider-muffins.jpg",
		"ingredients": {
			"Muffins": {
				"0": "175 g (6oz) Flora Buttery",
				"1": "175 g (6oz) golden caster sugar",
				"2": "300 g (11oz) self raising flour, sieved",
				"3": "3 medium eggs",
				"4": "5 tablespoons semi skimmed milk",
				"5": "100 g cooked pumpkin or butternut squash, mashed",
				"6": "40 g chocolate-hazelnut spread",
				"7": "zest of 1 orange"
			},
			"Topping": {
				"0": "115 g icing sugar",
				"1": "A little orange juice",
				"2": "55 g (2oz) plain chocolate, melted",
				"3": "Liquorice allsorts, to decorate"
			}
		},
		"directions": {
			"0": "Place 12 muffin cases into a muffin tray.",
			"1": "Place the first six ingredients into a bowl, and beat with a wooden spoon until the mixture is smooth.",
			"2": "Stir in pumpkin mash and orange zest and divide half the mixture evenly between the paper cases, add a half teaspoon chocolate spread and then top with remaining mix.",
			"3": "Bake in a pre-heated oven for 20-25 minutes oven 200°C, 180°C (fan assisted), Gas mark 6 for 20-25 minutes.",
			"4": "Add a little orange juice to the icing sugar until thick and spread over the muffins. Pipe the melted chocolate in 4 circles over the top and then drag a skewer through to give the cobweb effect. Place the sweets and laces on top to look like a spider."
		}
	},
	"Macaroni Cheese": {
		"title": "Macaroni Cheese",
		"description": "Could this be the ultimate comfort food dish? This easy recipe is macaroni cheese plus a little bit extra – not just soothing, creamy cheesy pasta but some more yummy bits too. Sweetcorn, chopped ham and diced red pepper all go in with the usual Cheddar cheese, macaroni and English mustard. Then everything’s sprinkled with more cheese and some breadcrumbs for an extra crunchy crusty top.",
		"prep_time": "PT20M",
		"prep_time_long": "20 minutes",
		"cook_time": "PT20M",
		"cook_time_long": "20 minutes",
		"yeild": "4 - 6",
		"yeild_long": "Serves 4 - 6",
		"image": "macaroni-cheese.jpg",
		"ingredients": {
			"0": "175g (6oz) macaroni",
			"1": "3 tbsp Flora Cuisine",
			"2": "55g (2oz) plain flour",
			"3": "600ml (1 pint) semi-skimmed milk",
			"4": "1 red pepper, deseeded and diced",
			"5": "1 x 210g (7oz) tinned sweetcorn",
			"6": "100 g (3½oz) ham, chopped",
			"7": "115 g (4oz) cheddar cheese, grated",
			"8": "0.5 tsp Colman's Mustard Powder",
			"9": "freshly ground black pepper",
			"10": "25 g (1oz) wholemeal breadcrumbs"
		},
		"directions": {
			"0": "Cook macaroni in a saucepan in fast boiling water for 10 minutes and drain well.",
			"1": "Place Flora, flour and milk in a saucepan and bring to the boil, whisking continuously until thickened.",
			"2": "Add pepper, sweetcorn, ham, 85g (3oz) cheese, mustard powder and seasoning. Simmer for 2–3 minutes. Stir in macaroni, then place in an ovenproof dish.",
			"3": "Sprinkle with remaining cheese and breadcrumbs. Cook in preheated oven 200ºC, 180ºC fan, gas mark 6 for 20 minutes until golden."
		}
	},
	"Roasted Vegetable Pasta": {
		"title": "Roasted Vegetable Pasta",
		"description": "This Vegetarian Roasted Vegetable Pasta recipe is delicious and packed with a selection of fresh vegetables. Try this tasty, easy and quick recipe, perfect for your weekly meals.",
		"prep_time": "PT15M",
		"prep_time_long": "15 minutes",
		"cook_time": "PT15M",
		"cook_time_long": "15 minutes",
		"yeild": "4 - 6",
		"yeild_long": "Serves 4 - 6",
		"image": "roasted-vegetable-pasta.jpg",
		"ingredients": {
			"0": "40 g Flora Light melted",
			"1": "2 tablespoons chopped fresh parsley",
			"2": "zest of 1 lemon",
			"3": "1 small red pepper, seeds removed and cut into thin strips",
			"4": "1 small green pepper, seeds removed and cut into thin strips",
			"5": "115 g button mushroom, halved",
			"6": "8 cherry tomatoes, halved",
			"7": "350 g pasta shapes",
			"8": "A little salt and pepper"
		},
		"directions": {
			"0": "In a small bowl, mix half the melted Flora Light with the parsley and the lemon rind. Set aside.",
			"1": "Brush the remaining melted Flora Light over the pepper pieces and arrange, in a single layer, on a baking tray.",
			"2": "Cook in a preheated oven at 200°C, 180°C fan, Gas mark 6 for 10 minutes.",
			"3": "Add the mushrooms and tomatoes to the peppers, brush with Flora Light and cook for a further 5 minutes.",
			"4": "Meanwhile cook the pasta following packet instructions and drain.",
			"5": "Toss the hot pasta with the roasted vegetables and the herb-and-lemon mixture. Season to taste and serve immediately."
		}
	},
	"Lemon-ginger Chicken Nuggets": {
		"title": "Lemon-ginger Chicken Nuggets",
		"description": "When grilled chicken just won’t do, these crispy and zingy little bites transform mealtime into a social affair. The zesty lemon keeps the chicken beautifully succulent and the ginger gives it a hint of warmth. Throw in salt and pepper for seasoning and fry in the pan until they get a beautiful golden coat. Then all that’s left is to decide on is your dip!",
		"prep_time": "PT10M",
		"prep_time_long": "10 minutes",
		"cook_time": "PT20M",
		"cook_time_long": "20 minutes",
		"yeild": "4 - 6",
		"yeild_long": "Serves 4 - 6",
		"image": "lemon-ginger-chicken-nuggets.jpg",
		"ingredients": {
			"0": "4 cm piece fresh ginger",
			"1": "juice of 1/2 lemon",
			"2": "1 clove garlic, crushed",
			"3": "2 skinless chicken breast fillet, cut into even-sized strips",
			"4": "salt and pepper",
			"5": "1 tbsp flour",
			"6": "1 egg",
			"7": "25 g fresh breadcrumbs, for coating",
			"8": "2- 3 tbsp Flora Cuisine, for shallow frying"
		},
		"directions": {
			"0": "Squeeze the juice from the ginger by grating it, placing in a cloth and squeezing.",
			"1": "Combine the ginger juice, lemon juice and garlic and rub this mixture over the chicken strips, seasoning with a little salt and pepper.",
			"2": "Coat the chicken first in flour, then in beaten egg and finally in breadcrumbs.",
			"3": "Heat the Flora Cuisine in a large, heavy-based frying pan over a low heat. Gently fry in batches until cooked through and golden."
		}
	}
}